import { Metadata } from 'next';

const metadata: Metadata = {
  title: 'SITCON Hackathon 2024',
  authors: [{ url: 'https://sitcon.org', name: 'SITCON' }],
  description:
    '縱觀人類發展，數字的概念一直是理解世界、量化事物的基石，利用石塊、獸骨與結繩等記號表示一到千萬的自然數概念；歷經千年時間，人類們才意識到「零」的數字概念存在。奠基於「從零到一」與「從一到百」，推演負數、有理數、無理數種種概念，從此開啟了數學的全新篇章。 19 世紀，人類提出了分析機，並成為現今電腦的空想雛形；20 年代中期，人類才成功創造了最基礎的電腦；在電子科技的快速進步下，僅不到百年的時間裡，我們現今已然能仰賴更加先進的技術與不同領域的發展，一窺接下來蓬勃發展的數位世界。 現在，我們有機會站在巨人的肩膀上，得以學習、創作並實踐前人千百年累積的知識與技術，這是一個讓我們思考過去、現在和未來的機會。 本屆黑客松主題為 __init__，參考自 Python 語言中初始化物件的方法，我們期待 SITCON Hackathon 與參賽者 一同開創新的旅程，實踐「從零到一」的精神。以 __init__ 的方式啟動我們的未來，跨出屬於我們世代的第一步。',
  keywords: ['hackathon', '黑客松', '校園黑客松'],
  themeColor: '#000',
  openGraph: {
    title: 'SITCON Hackathon',
    description:
      '縱觀人類發展，數字的概念一直是理解世界、量化事物的基石，利用石塊、獸骨與結繩等記號表示一到千萬的自然數概念；歷經千年時間，人類們才意識到「零」的數字概念存在。奠基於「從零到一」與「從一到百」，推演負數、有理數、無理數種種概念，從此開啟了數學的全新篇章。 19 世紀，人類提出了分析機，並成為現今電腦的空想雛形；20 年代中期，人類才成功創造了最基礎的電腦；在電子科技的快速進步下，僅不到百年的時間裡，我們現今已然能仰賴更加先進的技術與不同領域的發展，一窺接下來蓬勃發展的數位世界。 現在，我們有機會站在巨人的肩膀上，得以學習、創作並實踐前人千百年累積的知識與技術，這是一個讓我們思考過去、現在和未來的機會。 本屆黑客松主題為 __init__，參考自 Python 語言中初始化物件的方法，我們期待 SITCON Hackathon 與參賽者 一同開創新的旅程，實踐「從零到一」的精神。以 __init__ 的方式啟動我們的未來，跨出屬於我們世代的第一步。',
    url: 'https://hackathon.sitcon.org/2024',
    locale: 'zh_TW',
    siteName: 'SITCON Hackathon',
    type: 'website'
  }
};

export default metadata;
